renesas/rx-driver-package/source/r_sdhi_rx/r_sdhi_rx_vx.xx/r_sdhi_rx/src/targets/rx671/r_sdhi_dev.c
#if (SDHI_CFG_CH0_INCLUDED == 1)
    if (SDHI_CH0 == channel)
    {
        if (SDHI_CFG_CH0_WP_ACTIVE)
        {
            ret = SDHI_SUCCESS;
        }
    }
#endif  /* #if (SDHI_CFG_CH0_INCLUDED == 1) */

    return ret;
} /* End of function R_SDHI_WPLayout() */

/**********************************************************************************************************************
* Outline      : Card Access Option Register Init
* Function Name: r_sdhi_dev_sdopt_init
* Description  : Card Access Option Register Init.
* Arguments    : void
* Return Value : uint32_t
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdhi_dev_sdopt_init(void)
{
    return ((SDHI_SDOPT_INIT | SDHI_CFG_SDOPT_TOP) | SDHI_CFG_SDOPT_CTOP);
} /* End of function r_sdhi_dev_sdopt_init() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_GetSpeedType
 *****************************************************************************************************************/ /**
 * @brief This function gets information on the speed modes supported by the target microcontroller.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @retval    SDHI_SUCCESS Compatible with default-speed and high-speed modes
 * @retval    SDHI_ERR     Compatible with default-speed mode
 * @details   Gets information on the speed modes supported by the target microcontroller.
 * @note      None.
 */
sdhi_status_t R_SDHI_GetSpeedType(uint32_t channel)
{
    sdhi_status_t ret = SDHI_ERR;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

#if (SDHI_CFG_CH0_INCLUDED == 1)
    if (SDHI_CH0 == channel)
    {
        ret = SDHI_SUCCESS;
    }
#endif  /* #if (SDHI_CFG_CH0_INCLUDED == 1) */

    return ret;
} /* End of function R_SDHI_GetSpeedType() */

/**********************************************************************************************************************
* Outline      : SDHI CLKSEL BIT check
* Function Name: r_sdhi_check_clksel
* Description  : Check SDHI CLKSEL BIT.
* Arguments    : uint32_t           channel              ;   SDHI Channel No.
* Return Value : SDHI_SUCCESS                            ;   CLKSEL BIT: PCLK division by 1 setting permitted
*              : SDHI_ERR                                ;   CLKSEL BIT: PCLK division by 1 setting prohibited
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdhi_status_t r_sdhi_check_clksel(uint32_t channel)
{
    sdhi_status_t ret = SDHI_ERR;

#if (SDHI_CFG_CH0_INCLUDED == 1)
    if (SDHI_CH0 == channel)
    {
        ret = SDHI_SUCCESS;
    }
#endif  /* #if (SDHI_CFG_CH0_INCLUDED == 1) */

    return ret;
} /* End of function r_sdhi_check_clksel() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_IntHandler0
 *****************************************************************************************************************/ /**
 * @brief This function is the interrupt handler.
 * @param[in] *vect
 *             vector table
 * @details   This is the interrupt handler of the SDHI FIT module.\n 
 *            It is incorporated into the system as a processing routine for interrupt sources supported by the SDHI.\n
 *            When a callback function for the card access interrupt (CACI) and card detect interrupt (CDETI), 
 *            and a callback function for the SDIO access interrupt (SDACI) have been registered, 
 *            the appropriate callback function is called by this function.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
void R_SDHI_IntHandler0(void * vect)
{
    sdhi_sdhndl_t   * p_hndl = 0;
    uint32_t          int_isr = 0;
    uint32_t          channel = 0;
    uint32_t          sdsts1 = 0;
    uint32_t          sdsts2 = 0;
    uint32_t          sdiosts = 0;

    channel = 0;
    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    int_isr = ICU.GRPBL1.LONG;

    /* SDHI_MEM */
    if (int_isr & (SDHI_CH0_INT_CDETI | SDHI_CH0_INT_CACI))
    {
        sdsts1 = SDHI_INREG(p_hndl, SDHI_SDSTS1);
        sdsts2 = SDHI_INREG(p_hndl, SDHI_SDSTS2);
        if (sdsts1 | sdsts2)
        {
            if (p_hndl->int_callback)
            {
                (*p_hndl->int_callback)(sdsts1, sdsts2);
            }
        }
    }

    /* SDHI_SDIO */
    if (int_isr & SDHI_CH0_INT_SDACI)
    {
        sdiosts = SDHI_INREG(p_hndl, SDHI_SDIOSTS);
        if (sdiosts)
        {
            if (p_hndl->int_io_callback)
            {
                (*p_hndl->int_io_callback)(sdiosts);
            }
        }
    }

    return;

} /* End of function R_SDHI_IntHandler0() */

/**********************************************************************************************************************
* Outline      : Hardware Lock
* Function Name: r_sdhi_dev_hardware_lock
* Description  : Hardware Lock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was acquired.
*              : false                          ; Lock was not acquired.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdhi_dev_hardware_lock(uint32_t channel)
{
    return R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_SDHI + channel));
} /* End of function r_sdhi_dev_hardware_lock() */

/**********************************************************************************************************************
* Outline      : Hardware Unlock
* Function Name: r_sdhi_dev_hardware_unlock
* Description  : Hardware Unlock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was released.
*              : false                          ; Lock was not released.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_sdhi_dev_hardware_unlock(uint32_t channel)
{
    return R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_SDHI + channel));
} /* End of function r_sdhi_dev_hardware_unlock() */

#endif /* defined(BSP_MCU_RX671) */

/* End of File */
